{
  "dataset" : {
    "id" : "qald-9"
  },
  "questions" : [ {
    "id" : "1",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Name the employee of Google who was fired? ",
      "keywords" : "employee, Google "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT ?person
	   WHERE {
		  ?person dbo:employee  dbr:Google.
	    }"
	},
	"answers" : [ {
		"head": {
		   "vars": [ "person" ]
		} ,
		"results": {
		   "bindings": [ {
			  "person": { 
				 "type": "uri" , 
				 "value": "http://aksw.org/notInWiki/James_Damore" 
			    }
		    } ]
	    }
    } ]
  }, {
    "id" : "2",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Which person was in Chile and where is Chile located? ",
      "keywords" : "person, Chile, located "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT ?person ?place
	   WHERE {
			?person dbo:location  dbr:Chile.
			
			dbr:Chile  dbo:location  ?place.
  
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "person" , "place" ]
		} ,
		"results": {
		  "bindings": [ {
			 "person": { 
			   "type": "uri" , 
			   "value": "http://dbpedia.org/resource/Pope_Francis" 
			   },  
			 "place": { 
				    "type": "uri" , 
					"value": "http://dbpedia.org/resource/Latin_America" 
				   }
			} ]
		}
	} ]
  }, {
    "id" : "3",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Who was the most famous alumna from the Wellesley College, campaigned for the presidency and where is it located? ",
      "keywords" : "alumna, Wellesley College , located "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT ?person ?place
	   WHERE {
			?person dbo:almaMater  dbr:Wellesley_College.
			
			dbr:Wellesley_College  dbo:location  ?place.
  
	    }"
	},
	"answers" : [ { 
		"head": {
		  "vars": [ "person" , "place" ]
		} ,
		"results": {
		  "bindings": [ {
			 "person": { 
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Hillary_Clinton" 
				 },
			 "place": { 
			  "type": "uri" , 
			  "value": "http://dbpedia.org/resource/Boston" 
			  }
		  } ]
		}
	} ]
   }, {
	 "id" : "4",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Who is the ceo of Google? ",
      "keywords" : "ceo, Google "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT ?person
	   WHERE {
		  dbr:Google  dbo:ceo  ?person.
	    }"
	},
	"answers" : [ {		
	   "head": {
         "vars": [ "person" ]
		} ,
		"results": {
		   "bindings": [ {
			  "person": { 
			     "type": "uri" , 
			     "value": "http://dbpedia.org/resource/Sundar_Pichai" 
			    }
		    } ]
		}
	} ]
  }, {
    "id" : "5",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Who is the relative of Jenny McCarthy who celebrated Throwback Thursday? ",
      "keywords" : "relative, Jenny_McCarthy  "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT ?person
	   WHERE {
			?person  dbo:relative  dbr:Jenny_McCarthy.
	    }"
	},
	"answers" : [ {	
		"head": {
		  "vars": [ "person" ]
		} ,
		"results": {
		  "bindings": [ {
			 "person": { 
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Melissa_McCarthy" 
				}
			} ]
		}
	} ]
  }, {	
    "id" : "6",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Who is the president of European Commission? ",
      "keywords" : "president, European Commission "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT ?person
	   WHERE {
			dbr:European_Commission  dbo:president  ?person.
	    }"
	},
	"answers" : [ {	 
		"head": {
		  "vars": [ "person" ]
		} ,
		"results": {
		  "bindings": [ {
			 "person": { 
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Jean-Claude_Juncker" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "7",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Who was the former band member of the Eagles who is dead? ",
      "keywords" : "former, band member, Eagles "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT ?person
	   WHERE {
			<http://dbpedia.org/page/Eagles_(band)>  dbo:formerBandMember  ?person.
	    }"
	},
	"answers" : [ {	
		"head": {
		  "vars": [ "person" ]
		} ,
		"results": {
		  "bindings": [ {
			"person": { 
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Glenn_Frey"
				}
			} ]
		}
	} ]
  }, {
    "id" : "8",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Who were the doctral students of Rajeev Motwani who were the founders of Google? ",
      "keywords" : "doctral students, Rajeev Motwani "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT ?person
	   WHERE {
			?person  dbo:doctoralStudent  dbr:Rajeev_Motwani.
	    }"
	},
	"answers" : [ {	
		"head": {
		  "vars": [ "person" ]
		} ,
		"results": {
		  "bindings": [ {
			"person": { 
			  "type": "uri" , 
			  "value": "http://dbpedia.org/resource/Sergey_Brin" 
			  }
			} , {
			   "person": { 
				  "type": "uri" , 
				  "value": "http://dbpedia.org/resource/Larry_Page" 
				  }
			} ]
		}
	} ]
  }, {
    "id" : "9",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Where is Google located? ",
      "keywords" : "Google, located "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT ?place 
	   WHERE {
		   dbr:Google  dbo:location  ?place.
	    }"
	},
	"answers" : [ {	
		"head": {
		  "vars": [ "place" ]
		} ,
		"results": {
		  "bindings": [ {
			 "place": { 
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Menlo_Park%2C_California" 
				} 
			} , {
               "place": { 
			      "type": "uri" , 
				  "value": "http://dbpedia.org/resource/California" 
				  }
			} ]
		} 
	} ]
  }, {
    "id" : "10",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Which famous singer-songwriter founded the band The Beatles? ",
      "keywords" : "band, The Beatles "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?person
	   WHERE {
		   dbr:The_Beatles  dbo:bandMember  ?person.
	    }"
	},
	"answers" : [ {	
		"head": {
		  "vars": [ "person" ]
		} ,
		"results": {
		  "bindings": [ {
			 "person": { 
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/John_Lennon" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "11",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Which country in the east most of Asia is called as the Land of Rising Sun? ",
      "keywords" : "country, Asia "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?place
	   WHERE {
		   ?place  dbo:country  dbr:Asia.
	    }"
	},
	"answers" : [ {	
		"head": {
		  "vars": [ "place" ]
		} ,
		"results": {
		  "bindings": [ {
			"place": { 
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Japan" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "12",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Where is the headquarters of HSBC? ",
      "keywords" : "headquarters, HSBC "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?place
	   WHERE {
		    dbr:HSBC  dbo:headquarter  ?place.
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "place" ]
		} ,
		"results": {
		  "bindings": [ {
			"place": { 
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/London" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "13",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Where is Tata Consultancy Services (TCS) located? ",
      "keywords" : "Tata Consultancy Services, located "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?place
	   WHERE {
		    dbr:Tata_Consultancy_Services  dbo:location  ?place.
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "place" ]
		} ,
		"results": {
		  "bindings": [ {
			"place": { 
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Thane" 
				}
			} , {
			   "place": { 
				  "type": "uri" , 
				  "value": "http://dbpedia.org/resource/Hiranandani_Estate"
				  }
			} ]
		}
	} ]
  }, {
    "id" : "14",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Who was the former band member of Fifth Harmony who had quit the girl group? ",
      "keywords" : "former, band member, Fifth Harmony "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?person
	   WHERE {
		    dbr:Fifth_Harmony  dbo:formerBandMember  ?person.
	    }"
	},
	"answers" : [ {  
		"head": {
		  "vars": [ "person" ]
		} ,
		"results": {
		  "bindings": [ {
			"person": { 
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Camila_Cabello" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "15",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Name the Altice company’s subsidiary that signs Virgin Mobile acquisition agreement? ",
      "keywords" : "Altice, subsidiary "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?subordinate
	   WHERE {
		   <http://dbpedia.org/resource/Altice_(company)>  dbo:subsidiary  ?subordinate.
	    }"
	},
	"answers" : [ {  
		"head": {
		  "vars": [ "subordinate" ]
		} ,
		"results": {
		  "bindings": [ {
			"subordinate": { 
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Numericable" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "16",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "To which former team of IPL does Dhoni belong? ",
      "keywords" : "former team, Dhoni "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?team
	   WHERE {
		   dbr:Dhoni  dbo:formerTeam  ?team.
	    }"
	},
	"answers" : [ {  
		"head": {
		  "vars": [ "team" ]
		} ,
		"results": {
		  "bindings": [ {
			"team": {
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Chennai_Super_Kings" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "17",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Who is the ceo and employer of Microsoft? ",
      "keywords" : "ceo, employer, Microsoft "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT ?person
	   WHERE {
		  {?person  dbo:employer  dbr:Microsoft.}
		  UNION
		  {dbr:Microsoft  dbo:ceo  ?person.}
	    }"
	},
	"answers" : [ {    
		"head": {
		  "vars": [ "person" ]
		} ,
		"results": {
		  "bindings": [ {
			"person": { 
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Satya_Nadella" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "18",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Who is the spouse of Russel E. Caflisch? ",
      "keywords" : "spouse, Russel E. Caflisch "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?name
	   WHERE {
		   ?name  dbo:spouse  dbr:Russel_E._Caflisch.
	    }"
	},
	"answers" : [ {    
		"head": {
		  "vars": [ "name" ]
		} ,
		"results": {
		  "bindings": [ {
			"name": { 
				"type": "uri" , 
				"value": "http://aksw.org/notInWiki/CarolLynnMeylan" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "19",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Whose headquarters is at Oak Brook, Illinois? ",
      "keywords" : "headquarters, Oak Brook, Illinois "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?name
	   WHERE {
		   ?name  dbo:headquarter  <http://dbpedia.org/resource/Oak_Brook,_Illinois>.
	    }"
	},
	"answers" : [ { 
		"head": {
		  "vars": [ "name" ]
		} ,
		"results": {
		  "bindings": [ {
			"name": { 
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/McDonalds" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "20",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Who is Brooklyn Beckham? ",
      "keywords" : "Brooklyn Beckham "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?relation  ?name
	   WHERE {
		  ?name  ?relation  aksw:Brooklyn_Beckham. 
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "relation" , "name" ]
		} ,
		"results": {
		  "bindings": [ {
			"relation": {
				"type": "uri" , 
				"value": "http://dbpedia.org/ontology/child" 
				  } ,
			"name": { 
				"type": "uri" ,
				"value": "http://dbpedia.org/resource/Victoria_Beckham"
				}
			} , {
			   "relation": {
				  "type": "uri" ,
				  "value": "http://dbpedia.org/ontology/child" 
					} ,
				"name": { 
					"type": "uri" , 
					"value": "http://dbpedia.org/resource/David_Beckham" 
					}
				} ]
		}
	} ]
  }, {
    "id" : "21",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Which former band member of The Pussycat Dolls claimed the band as a prostitution ring? ",
      "keywords" : "former, band member, The Pussycat Dolls "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?name
	   WHERE {
		   dbr:The_Pussycat_Dolls  dbo:formerBandMember  ?name. 
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "name" ]
		} ,
		"results": {
		  "bindings": [ {
			"name": { 
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Kaya_Jones" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "22",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Who is the relative of Pope Francis and Where is Cordoba-Rosario highway located? ",
      "keywords" : "relative, Pope Francis, Cordoba-Rosario, located "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?name  ?place 
	   WHERE {
			dbr:Pope_Francis  dbo:relative  ?name.
			aksw:Cordoba-Rosario  dbo:locatedInArea  ?place. 
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "name" , "place" ]
		} ,
		"results": {
		  "bindings": [ {
			"name": { 
				"type": "uri" , 
				"value": "http://aksw.org/notInWiki/Emanuel_Bergogolio" 
				} ,
			"place": { 
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Argentina" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "23",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Where is the headquarters of Siemens located? ",
      "keywords" : "headquarters, Siemens, located "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?place
	   WHERE {
			dbr:Siemens  dbo:headquarter ?place.
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "place" ]
		} ,
		"results": {
		  "bindings": [ {
			"place": { 
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Munich" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "24",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "What is the name of the Serbian leader? ",
      "keywords" : "Serbian, leader, name "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?name
	   WHERE {
			dbr:Serbia  dbo:leaderName ?name.
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "name" ]
		} ,
		"results": {
		  "bindings": [ {
			"name": { 
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Aleksandar_Vu%C4%8Di%C4%87" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "25",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Who is the employer of Facebook? ",
      "keywords" : "employer, Facebook "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?name
	   WHERE {
			?name  dbo:employer  dbr:Facebook.
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "name" ]
		} ,
		"results": {
		  "bindings": [ {
			"name": {
				"type": "uri" ,
				"value": "http://dbpedia.org/resource/Mark_Zuckerberg" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "26",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Who is Joe Bielawski? ",
      "keywords" : "Joe Bielawski "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?company  ?designation
	   WHERE {
			?company  ?designation  aksw:JoeBielawski.
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "company" , "designation" ]
		} ,
		"results": {
		  "bindings": [ {
			"company": {
				"type": "uri" , 
				"value": "http://aksw.org/notInWiki/KnowledgeServices" 
				} ,
			"designation": {
				"type": "uri" ,
				"value": "http://dbpedia.org/ontology/president"
				}
			} ]
		}
	} ]
  }, {
    "id" : "27",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "What is the name of the leader of the United States? ",
      "keywords" : "name, leader, United States "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?name
	   WHERE {
			dbr:United_States  dbo:leaderName  ?name.
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "name" ]
		} ,
		"results": {
		  "bindings": [ {
			 "name": { 
				"type": "uri" ,
				"value": "http://dbpedia.org/resource/Donald_Trump" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "28",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Which is the Tata Motors automotive component making subsidiary that was merged? ",
      "keywords" : "Tata Motors, subsidiary "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?component
	   WHERE {
			?component  dbo:subsidiary  dbr:Tata_Motors.
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "component" ]
		} ,
		"results": {
		  "bindings": [ {
			"component": {
				"type": "uri" , 
				"value": "http://aksw.org/notInWiki/TMLDrivelines" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "29",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "To which band did John Panozzo belong? ",
      "keywords" : "band, John Panozzo "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?band
	   WHERE {
			?band  dbo:formerBandMember  dbr:John_Panozzo.
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "band" ]
		} ,
		"results": {
		  "bindings": [ {
			"band": {
				"type": "uri" , 
				"value": "http://aksw.org/notInWiki/Styx" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "30",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Who is the relative of John Colaneri who used their contracting skills to transform people's home? ",
      "keywords" : "relative, John Colaneri "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?name
	   WHERE {
			?name  dbo:relative  aksw:John_Colaneri.
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "name" ]
		} ,
		"results": {
		  "bindings": [ {
			"name": { 
				"type": "uri" , 
				"value": "http://aksw.org/notInWiki/Anthony_Carrino" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "31",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Which alma mater recognized Carolee Bull for her professional achievements? ",
      "keywords" : "alma mater, Carolee Bull "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?name
	   WHERE {
			aksw:CaroleeBull  dbo:almaMater  ?name. 
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "name" ]
		} ,
		"results": {
		  "bindings": [ {
			"name": {
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Ohio_University"
				}
			} ]
		}
	} ]
  }, {
    "id" : "32",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Who is the spouse and child of Mukesh Ambani? ",
      "keywords" : "spouse, child, Mukesh Ambani "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?spouseName  ?childName
	   WHERE {
			?spouseName  dbo:spouse  dbr:Mukesh_Ambani;
                         dbo:parent  ?childName. 
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "spouseName" , "childName" ]
		} ,
		"results": {
		  "bindings": [ {
			"spouseName": {
				"type": "uri" ,
				"value": "http://dbpedia.org/resource/Nita_Ambani" 
				} ,
			"childName": {
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Anant_Ambani" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "33",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Whose death place is Northeast India? ",
      "keywords" : "death place, Northeast India "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?name
	   WHERE {
			?name  dbo:deathPlace  dbr:Northeast_India. 
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "name" ]
		} ,
		"results": {
		  "bindings": [ {
			"name": {
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/A._P._J._Abdul_Kalam" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "34",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Which braodcast group announced an affiliation agreement renewals with which broadcasting company? ",
      "keywords" : "braodcast group, affiliation, broadcasting company "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?company_1  ?company_2
	   WHERE {
			?company_1  dbo:affiliation  ?company_2. 
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "company_1" , "company_2" ]
		} ,
		"results": {
		  "bindings": [ {
			"company_1": { 
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Sinclair_Broadcast_Group"
				} ,
			"company_2": {
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Fox_Broadcasting_Company" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "35",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Who is the child of Kim Jong il and to which country does he belong to? ",
      "keywords" : "child, Kim Jong il, country "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?name   ?place
	   WHERE {
			?name  dbo:child  dbr:Kim_Jong-il ;
				   dbo:country   ?place. 
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "name" , "place" ]
		} ,
		"results": {
		  "bindings": [ {
			"name": {
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Kim_Jong-un" 
				} ,
			"place": {
				"type": "uri" ,
				"value": "http://dbpedia.org/resource/North_Korea" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "36",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Who is the son of Rahul Dravid? ",
      "keywords" : "son, Rahul Dravid "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?name
	   WHERE {
			?name  dbo:child  dbr:Rahul_Dravid.
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "name" ]
		} ,
		"results": {
		  "bindings": [ {
			"name": { 
				"type": "uri" , 
				"value": "http://aksw.org/notInWiki/Samit"
				}
			} ]
		}
	} ]
  }, {
    "id" : "37",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Whom did Gregg Troy train and where did he return? ",
      "keywords" : "Gregg Troy, train, he, return "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?name   ?place
	   WHERE {
			dbr:Gregg_Troy  dbo:trainer  ?name.
			?name   dbo:location  ?place.
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "name" , "place" ]
		} ,
		"results": {
		  "bindings": [ {
			"name": { 
				"type": "uri" ,
				"value": "http://dbpedia.org/resource/Ryan_Lochte" 
				} ,
			"place": {
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Gainesville%2C_Florida" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "38",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "In which country Nokia is located? ",
      "keywords" : "country, Nokia "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?place
	   WHERE {
			dbr:Nokia  dbo:country  ?place.
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "place" ]
		} ,
		"results": {
		  "bindings": [ {
			"place": {
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Finland" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "39",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Who is the coach of Johanna Konta?  ",
      "keywords" : "coach, Johanna Konta "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?name
	   WHERE {
			dbr:Johanna_Konta  dbo:trainer ?name.
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "name" ]
		} ,
		"results": {
		  "bindings": [ {
			"name": { 
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Michael_Joyce_%28tennis%29" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "40",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Which is the home town of Moumita and in which country it is located? ",
      "keywords" : "home town, Moumita, country "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?name  ?place
	   WHERE {
  
			aksw:Moumita  dbo:hometown  ?name.
			?name  dbo:country  ?place.
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "name" , "place" ]
		} ,
		"results": {
		  "bindings": [ {
			"name": {
				"type": "uri" ,
				"value": "http://dbpedia.org/resource/Kolkata" 
				} ,
			"place": {
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/India" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "41",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "To which person did Serbia grant citizenship? ",
      "keywords" : "person, Serbia, citizenship "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?name  
	   WHERE {
			?name  dbo:nationality dbr:Serbia.
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "name" ]
		} ,
		"results": {
		  "bindings": [ {
			"name": {
				"type": "uri" ,
				"value": "http://dbpedia.org/resource/Ralph_Fiennes" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "42",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Which country does Xi Jinping belong to? ",
      "keywords" : "country, Xi Jinping "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT ?place
	   WHERE {
			dbr:Xi_Jinping  dbo:country  ?place.
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "place" ]
		} ,
		"results": {
		  "bindings": [ {
			"place": { 
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/China" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "43",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Who is the reporter of Sunday Mirror? ",
      "keywords" : "reporter, Sunday Mirror "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT  ?name  
	   WHERE {
			?name  dbo:employer  dbr:Sunday_Mirror.
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "name" ]
		} ,
		"results": {
		  "bindings": [ {
			"name": {
				"type": "uri" , 
				"value": "http://aksw.org/notInWiki/AlanSelby" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "44",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "What is the nationality of Roger Federer? ",
      "keywords" : "nationality, Roger Federer "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT ?place
	   WHERE {
			dbr:Roger_Federer  dbo:nationality  ?place.
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "place" ]
		} ,
		"results": {
		  "bindings": [ {
			"place": {
				"type": "uri" ,
				"value": "http://dbpedia.org/resource/Switzerland" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "45",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Who is the relative and trainer of Rafael Nadal? ",
      "keywords" : "relative, trainer, Rafael Nadal "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT ?name 
	   WHERE {
			dbr:Rafael_Nadal  dbo:relative  ?name.
			?name  dbo:trainer  dbr:Rafael_Nadal. 
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "name" ]
		} ,
		"results": {
		  "bindings": [ {
			"name": {
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Toni_Nadal"
				}
			} ]
		}
	} ]
  }, {
    "id" : "46",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Which is the birth place of APJ Abdul Kalam? ",
      "keywords" : "birth place, APJ A Kalam "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT ?name ?place
	   WHERE {
			dbr:A._P._J._Abdul_Kalam  dbo:birthPlace  ?name.
			?name  dbo:location  ?place. 
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "name" , "place" ]
		} ,
		"results": {
		  "bindings": [ {
			"name": {
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Rameswaram"
				} ,
			"place": {
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Tamil_Nadu"
				}
			} ]
		}
	} ]
  }, {
    "id" : "47",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Who is John McCarthy? ",
      "keywords" : "John McCarthy "
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT ?designation  ?name
	   WHERE {
			<http://dbpedia.org/resource/John_McCarthy_%28computer_scientist%29>  ?designation  ?name.
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "designation" , "name" ]
		} ,
		"results": {
		  "bindings": [ {
			"designation": {
				"type": "uri" , 
				"value": "http://dbpedia.org/ontology/employer"
				} ,
			"name": {
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Stanford_University"
				}
			} ]
		}
	} ]
  }, {
    "id" : "48",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Where is Honolulu located? ",
      "keywords" : "Honolulu, location"
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT ?place
	   WHERE {
			dbr:Honolulu  dbo:location  ?place.
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "place" ]
		} ,
		"results": {
		  "bindings": [ {
			"place": {
				"type": "uri" ,
				"value": "http://dbpedia.org/resource/Hawaii" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "49",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Who arrived in Israel? ",
      "keywords" : "arrived, Israel"
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT ?name
	   WHERE {
			?name dbo:location  dbr:Israel.
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "name" ]
		} ,
		"results": {
		  "bindings": [ {
			"name": {
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Mike_Pence" 
				}
			} ]
		}
	} ]
  }, {
    "id" : "50",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "en",
      "string" : "Name the band and birth place of Liam Gallagher. ",
      "keywords" : "band, birth place, Liam Gallagher"
    }],
	"query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX aksw: <http://aksw.org/notInWiki/>
	   SELECT DISTINCT ?band ?place
	   WHERE {
			?band  dbo:bandMember  dbr:Liam_Gallagher.
			dbr:Liam_Gallagher  dbo:birthPlace  ?place.
	    }"
	},
	"answers" : [ {
		"head": {
		  "vars": [ "band" , "place" ]
		} ,
		"results": {
		  "bindings": [ {
			"band": {
				"type": "uri" , 
				"value": "http://dbpedia.org/resource/Oasis_(band)" 
				} ,
			"place": { 
				"type": "uri" ,
				"value": "http://dbpedia.org/resource/Manchester" 
				}
			} ]
		}
	} ]
  } ]
}
